app/views/devise/registrations/new.html.erb

      <%= f.label :city_id %>
      <%= f.collection_select :city_id, City.all, :id, :name, { :class => "form-control" } %>
---
SELECT "cities".* FROM "cities"