app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "New York"], ["short_name", "NY"], ["created_at", "2015-02-25 11:39:28.437493"], ["updated_at", "2015-02-25 11:39:28.437493"]]
---
  def create
    @city = City.new(city_params)
    flash[:notice] = 'City was successfully created.' if @city.save

DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 1]]
---
  def destroy
    @city.destroy